[
  {
    "name": "Sam Monet",
    "title": "Managing Partner",
    "bio": "Mr. Monet's local roots are deep in Hawaiian history, its lands and its people.  Mr. Monet' English ancestors came to the Sandwich Isles in 1840.  On their vessel, the barkentine \"Don Quixote\" the Lindsey family transported and traded goods between and islands.  Innovative people, they built the first steam driven lumber mill on the big island. Sam installed his first PV and battery off grid system in 1974.  A former general contractor, real estate broker, commercial property manager, hydroponic farmer and energy consultant; Mr. Monet has been responsible for approximately 4 mega watts of renewable energy systems on Oahu in the last 4 years.  Mr. Monet was the managing partner of Aloha Ethanol during its acquisition."
  },
  {
    "name": "Harald \"Kimo\" von Sydow",
    "title": "Project Manager",
    "bio": "Mr. von Sydow has been working with business owners in Hawaii for over 20 years, developing and deploying green, clean energy solutions and systems for commercial buildings, restaurants and the farming community. Kimo's speclaity is water reclamation and irrigation systems."
  },
  {
    "name": "Brad Robertson",
    "title": "Electrical Contractor/Solar Design Executive",
    "bio": "Mr. Robertson is a Hawaii electrical contractor, who for over 22 years has installed residential and commercial solar systems.  Our customers benefit from his expertise and experience; our staff from his knowledge."
  },
  {
    "name": "David Absher",
    "title": "PE/Engineering Executive",
    "bio": "Mr. Absher is a registered Hawaii licensed, Electrical Engineer who has been involved in alternative energy projects throughout the U.S. mainland, Canada, and Hawaii for the past thirty-five years. David has engineered, designed, installed and commissioned hydroelectric, wind, and solar power generating facilities for Ontario Power Authority, Seattle City Light and Tacoma Power and Light, through irrigation systems with East Contra Costa County Irrigation District and irrigation and generating systems with Madera-Chowchilla Power and Water Authority. In the early 1970’s, Mr. Absher was the project manager for Hawaii’s fist commercial wind farm at Hawi on the Island of Hawaii. "
  },
  {
    "name": "Catherine R. Johnson",
    "title": "Sales and Marketing Executive",
    "bio": "Ms. Johnson has been involved in renewable energy systems for many years on the mainland and Hawaii. Her work with national environmental groups provides a cornerstone for our business plan. Kate is a prolific artist responsible for most of our documents, graphics and videos. "
  }
]
